In [5]:
import pandas as pd
import numpy as np

In [6]:
miasta = pd.Series(
    [1.7, 0.7, 0.6, 0.6],
    index=['Warszawa', 'Kraków', 'Łódź', 'Poznań']
)
miasta

Warszawa    1.7
Kraków      0.7
Łódź        0.6
Poznań      0.6
dtype: float64

In [7]:
from datetime import datetime as d
df = pd.DataFrame({
        'first_name': ['Aleksandra', 'Tomek', 'Konrad', 'Katarzyna', 'Jan', 'Tomek'],
        'last_name': ['Nowak', 'Kowalski', 'Lewandowski', 'Woźniak', 'Wiśniewska', 'Błaszczykowski'],
        'gender': ['female', 'male', 'male', 'female', 'male', 'male'],
        'date_of_birth': [d(1988, 1, 10), d(1938, 10, 22), d(1986, 11, 20), 
                          d(1980, 2, 12), d(1978, 5, 21), d(1960, 3, 1)],
        'rate': [100, 90, 50, 110, 170, 40],
        'hours': [60, 20, 100, 60, 160, 70],
    },
    columns=('first_name', 'last_name', 'gender', 'date_of_birth', 'rate', 'hours'),
)
df

   first_name       last_name  gender date_of_birth  rate  hours
0  Aleksandra           Nowak  female    1988-01-10   100     60
1       Tomek        Kowalski    male    1938-10-22    90     20
2      Konrad     Lewandowski    male    1986-11-20    50    100
3   Katarzyna         Woźniak  female    1980-02-12   110     60
4         Jan      Wiśniewska    male    1978-05-21   170    160
5       Tomek  Błaszczykowski    male    1960-03-01    40     70